---
kind: property
id: P:Autodesk.Revit.DB.GradientBackgroundSettings.GroundColor
source: html/9ae2d589-32d0-650d-4140-5137f25e8f6b.htm
---
# Autodesk.Revit.DB.GradientBackgroundSettings.GroundColor Property

The color of the ground.

## Syntax (C#)
```csharp
public Color GroundColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null